Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terraform plan $ATLANTIS_TERRAFORM_VARS' in '/atlantis-data/repos/Barsmiko1/orion-atlantis-eks-deployment/12/default': exit status 1: running "terraform plan $ATLANTIS_TERRAFORM_VARS" in "/atlantis-data/repos/Barsmiko1/orion-atlantis-eks-deployment/12/default": 
null_resource.example: Refreshing state... [id=8072732795150734593]
data.aws_caller_identity.current: Reading...
module.eks.aws_iam_role.node: Refreshing state... [id=atlantis-cluster-node-role]
module.iam_roles.aws_iam_policy.atlantis: Refreshing state... [id=arn:aws:iam::443370674281:policy/atlantis-cluster-atlantis-policy]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0cfc5c9c1ba567536]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0574721186bfb8435]
module.iam_roles.data.aws_caller_identity.current: Reading...
module.eks.aws_iam_role.cluster: Refreshing state... [id=atlantis-cluster-cluster-role]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-06f76480c14b039fd]
data.aws_caller_identity.current: Read complete after 0s [id=443370674281]
module.iam_roles.data.aws_caller_identity.current: Read complete after 0s [id=443370674281]
module.iam_roles.aws_iam_role.eks_readonly: Refreshing state... [id=atlantis-cluster-eks-readonly]
module.iam_roles.aws_iam_role.eks_admin: Refreshing state... [id=atlantis-cluster-eks-admin]
module.eks.aws_iam_role_policy_attachment.node_AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=atlantis-cluster-node-role-20250523113621591300000002]
module.eks.aws_iam_role_policy_attachment.node_AmazonEKS_CNI_Policy: Refreshing state... [id=atlantis-cluster-node-role-20250523113621593800000003]
module.eks.aws_iam_role_policy_attachment.node_AmazonEKSWorkerNodePolicy: Refreshing state... [id=atlantis-cluster-node-role-20250523113621759100000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=atlantis-cluster-cluster-role-20250523113621645600000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceController: Refreshing state... [id=atlantis-cluster-cluster-role-20250523113621551700000001]
module.iam_roles.aws_iam_role_policy.eks_admin: Refreshing state... [id=atlantis-cluster-eks-admin:atlantis-cluster-eks-admin-policy]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-094a63a57382ca927]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f34c910cd589780e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09c282059af8877f2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-001fb09b74e5ebb2b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b94c14fec8b65c95]
module.iam_roles.aws_iam_role_policy.eks_readonly: Refreshing state... [id=atlantis-cluster-eks-readonly:atlantis-cluster-eks-readonly-policy]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-08cd8816117ce8558]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0cc1087496b2ad42b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-090ab815bbe02d95b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00d6f273dc424ea28]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-055997cad6cb61918]
module.eks.aws_eks_cluster.this: Refreshing state... [id=atlantis-cluster]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09657015c081716c8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e57dd9d25ad7bdd4]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c58a409ac12edc41]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05e55d91bc67f4fc0]
module.eks.aws_eks_node_group.this: Refreshing state... [id=atlantis-cluster:atlantis-cluster-node-group]
module.iam_roles.aws_iam_role.atlantis: Refreshing state... [id=atlantis-cluster-atlantis-role]
module.eks.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::443370674281:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/DC71F8E2D326FB60A54C9807509323B6]
aws_iam_role.ebs_csi_driver: Refreshing state... [id=atlantis-cluster-ebs-csi-driver]
module.iam_roles.kubernetes_cluster_role_binding.readonly: Refreshing state... [id=eks-readonly-binding]
module.iam_roles.kubernetes_cluster_role_binding.admin: Refreshing state... [id=eks-admin-binding]
module.iam_roles.aws_iam_role_policy_attachment.atlantis: Refreshing state... [id=atlantis-cluster-atlantis-role-2025052311433299310000000c]
aws_iam_role_policy_attachment.ebs_csi_driver: Refreshing state... [id=atlantis-cluster-ebs-csi-driver-2025052311433310450000000d]
aws_eks_addon.ebs_csi_driver: Refreshing state... [id=atlantis-cluster:aws-ebs-csi-driver]
kubernetes_storage_class.ebs: Refreshing state... [id=ebs-sc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.eks.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/DC71F8E2D326FB60A54C9807509323B6"
    }

  # module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "atlantis-cluster"
        name                          = "atlantis-cluster"
        tags                          = {}
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ subnet_ids                = [
              - "subnet-001fb09b74e5ebb2b",
              - "subnet-0f34c910cd589780e",
            ] -> (known after apply)
            # (6 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.this must be replaced
-/+ resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-west-2:443370674281:nodegroup/atlantis-cluster/atlantis-cluster-node-group/a2cb7e7a-4eef-8df2-d4af-5ddb477c28cf" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "atlantis-cluster:atlantis-cluster-node-group" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.32.3-20250519" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-atlantis-cluster-node-group-a2cb7e7a-4eef-8df2-d4af-5ddb477c28cf"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      ~ subnet_ids             = [
          - "subnet-001fb09b74e5ebb2b",
          - "subnet-0f34c910cd589780e",
        ] -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ version                = "1.32" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ node_repair_config (known after apply)

      ~ update_config (known after apply)
      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "eks" {
        id              = "arn:aws:iam::443370674281:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/DC71F8E2D326FB60A54C9807509323B6"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-094a63a57382ca927"
        tags     = {
            "Name" = "atlantis-vpc-igw"
        }
      ~ vpc_id   = "vpc-0cfc5c9c1ba567536" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id                     = "eipassoc-0b9954b7fcf525fd6" -> (known after apply)
      ~ id                                 = "nat-090ab815bbe02d95b" -> (known after apply)
      ~ network_interface_id               = "eni-0834333fb1b90ba8b" -> (known after apply)
      ~ private_ip                         = "10.0.101.37" -> (known after apply)
      ~ public_ip                          = "44.238.101.128" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0b94c14fec8b65c95" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "atlantis-vpc-nat-0"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id                     = "eipassoc-017ff1dd0a431a8ff" -> (known after apply)
      ~ id                                 = "nat-0cc1087496b2ad42b" -> (known after apply)
      ~ network_interface_id               = "eni-00695ef535fe515ec" -> (known after apply)
      ~ private_ip                         = "10.0.102.161" -> (known after apply)
      ~ public_ip                          = "44.246.240.88" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-09c282059af8877f2" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "atlantis-vpc-nat-1"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-west-2:443370674281:route-table/rtb-0e57dd9d25ad7bdd4" -> (known after apply)
      ~ id               = "rtb-0e57dd9d25ad7bdd4" -> (known after apply)
      ~ owner_id         = "443370674281" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-090ab815bbe02d95b"
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
        tags             = {
            "Name" = "atlantis-vpc-private-rt-0"
        }
      ~ vpc_id           = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table.private[1] must be replaced
-/+ resource "aws_route_table" "private" {
      ~ arn              = "arn:aws:ec2:us-west-2:443370674281:route-table/rtb-09657015c081716c8" -> (known after apply)
      ~ id               = "rtb-09657015c081716c8" -> (known after apply)
      ~ owner_id         = "443370674281" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
      ~ route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-0cc1087496b2ad42b"
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
        tags             = {
            "Name" = "atlantis-vpc-private-rt-1"
        }
      ~ vpc_id           = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table.public must be replaced
-/+ resource "aws_route_table" "public" {
      ~ arn              = "arn:aws:ec2:us-west-2:443370674281:route-table/rtb-08cd8816117ce8558" -> (known after apply)
      ~ id               = "rtb-08cd8816117ce8558" -> (known after apply)
      ~ owner_id         = "443370674281" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
        tags             = {
            "Name" = "atlantis-vpc-public-rt"
        }
      ~ vpc_id           = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0c58a409ac12edc41" -> (known after apply)
      ~ route_table_id = "rtb-0e57dd9d25ad7bdd4" -> (known after apply)
      ~ subnet_id      = "subnet-001fb09b74e5ebb2b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-05e55d91bc67f4fc0" -> (known after apply)
      ~ route_table_id = "rtb-09657015c081716c8" -> (known after apply)
      ~ subnet_id      = "subnet-0f34c910cd589780e" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-055997cad6cb61918" -> (known after apply)
      ~ route_table_id = "rtb-08cd8816117ce8558" -> (known after apply)
      ~ subnet_id      = "subnet-0b94c14fec8b65c95" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-00d6f273dc424ea28" -> (known after apply)
      ~ route_table_id = "rtb-08cd8816117ce8558" -> (known after apply)
      ~ subnet_id      = "subnet-09c282059af8877f2" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-west-2:443370674281:subnet/subnet-001fb09b74e5ebb2b" -> (known after apply)
      ~ availability_zone_id                           = "usw2-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-001fb09b74e5ebb2b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "443370674281" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                                   = "atlantis-vpc-private-0"
            "kubernetes.io/cluster/atlantis-cluster" = "shared"
            "kubernetes.io/role/internal-elb"        = "1"
        }
      ~ vpc_id                                         = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-west-2:443370674281:subnet/subnet-0f34c910cd589780e" -> (known after apply)
      ~ availability_zone_id                           = "usw2-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0f34c910cd589780e" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "443370674281" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                                   = "atlantis-vpc-private-1"
            "kubernetes.io/cluster/atlantis-cluster" = "shared"
            "kubernetes.io/role/internal-elb"        = "1"
        }
      ~ vpc_id                                         = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-west-2:443370674281:subnet/subnet-0b94c14fec8b65c95" -> (known after apply)
      ~ availability_zone_id                           = "usw2-az1" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0b94c14fec8b65c95" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "443370674281" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                                   = "atlantis-vpc-public-0"
            "kubernetes.io/cluster/atlantis-cluster" = "shared"
            "kubernetes.io/role/elb"                 = "1"
        }
      ~ vpc_id                                         = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-west-2:443370674281:subnet/subnet-09c282059af8877f2" -> (known after apply)
      ~ availability_zone_id                           = "usw2-az2" -> (known after apply)
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-09c282059af8877f2" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "443370674281" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name"                                   = "atlantis-vpc-public-1"
            "kubernetes.io/cluster/atlantis-cluster" = "shared"
            "kubernetes.io/role/elb"                 = "1"
        }
      ~ vpc_id                                         = "vpc-0cfc5c9c1ba567536" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-west-2:443370674281:vpc/vpc-0cfc5c9c1ba567536" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.1.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-04fb1d39d748da057" -> (known after apply)
      ~ default_route_table_id               = "rtb-0f5667bd97dfd7a23" -> (known after apply)
      ~ default_security_group_id            = "sg-030031c37e1351932" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0678d0777c6ffdf95" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-0cfc5c9c1ba567536" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0f5667bd97dfd7a23" -> (known after apply)
      ~ owner_id                             = "443370674281" -> (known after apply)
        tags                                 = {
            "Name"                                   = "atlantis-vpc"
            "kubernetes.io/cluster/atlantis-cluster" = "shared"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 15 to add, 3 to change, 15 to destroy.

Changes to Outputs:
  ~ private_subnet_ids            = [
      ~ "subnet-001fb09b74e5ebb2b" -> (known after apply),
      ~ "subnet-0f34c910cd589780e" -> (known after apply),
    ]
  ~ public_subnet_ids             = [
      ~ "subnet-0b94c14fec8b65c95" -> (known after apply),
      ~ "subnet-09c282059af8877f2" -> (known after apply),
    ]
  ~ vpc_id                        = "vpc-0cfc5c9c1ba567536" -> (known after apply)
╷
│ Error: Get "https://DC71F8E2D326FB60A54C9807509323B6.gr7.us-west-2.eks.amazonaws.com/apis/storage.k8s.io/v1/storageclasses/ebs-sc": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with kubernetes_storage_class.ebs,
│   on main.tf line 116, in resource "kubernetes_storage_class" "ebs":
│  116: resource "kubernetes_storage_class" "ebs" {
│ 
╵
╷
│ Error: Get "https://DC71F8E2D326FB60A54C9807509323B6.gr7.us-west-2.eks.amazonaws.com/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/eks-admin-binding": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with module.iam_roles.kubernetes_cluster_role_binding.admin,
│   on modules/iam/main.tf line 76, in resource "kubernetes_cluster_role_binding" "admin":
│   76: resource "kubernetes_cluster_role_binding" "admin" {
│ 
╵
╷
│ Error: Get "https://DC71F8E2D326FB60A54C9807509323B6.gr7.us-west-2.eks.amazonaws.com/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/eks-readonly-binding": getting credentials: exec: executable aws not found
│ 
│ It looks like you are trying to use a client-go credential plugin that is not installed.
│ 
│ To learn more about this feature, consult the documentation available at:
│       https://kubernetes.io/docs/reference/access-authn-authz/authentication/#client-go-credential-plugins
│ 
│   with module.iam_roles.kubernetes_cluster_role_binding.readonly,
│   on modules/iam/main.tf line 95, in resource "kubernetes_cluster_role_binding" "readonly":
│   95: resource "kubernetes_cluster_role_binding" "readonly" {
│ 
╵

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- atlantis in modules/atlantis
- eks in modules/eks
- iam_roles in modules/iam
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/kubernetes...
- Finding latest version of hashicorp/null...
- Finding latest version of hashicorp/tls...
- Finding latest version of hashicorp/helm...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/kubernetes v2.37.1...
- Installed hashicorp/kubernetes v2.37.1 (signed by HashiCorp)
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)
- Installing hashicorp/tls v4.1.0...
- Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.17.0...
- Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
- Installing hashicorp/aws v5.98.0...
- Installed hashicorp/aws v5.98.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```
</details>